<template>
  <div class="container home">
    <h1>Система менеджмента качества</h1>
    <p class="main-description">
      Анкетирование проводится с целью определения степени удовлетворенности структурных
      подразделений Общества качеством функционирования обеспечивающих и вспомогательных
      бизнес-процессов
    </p>
    <ButtonComponent
      v-if="roleStore.isRespondent"
      text="Перейти к опросу"
      icon-class="fa-solid fa-arrow-right"
      @click="goToSurvey"
    />
    <div class="memorandum">
      <h3>Памятка по заполнению анкеты</h3>
      <p>
        Респонденты (участники анкетирования) оценивают деятельность вспомогательных/обеспечивающих
        СП, определяя степень удовлетворенности качеством функционирования обеспечивающих и
        вспомогательных бизнес-процессов.
      </p>
      <p>Оценка выставляется от 0 до 10 баллов, где:</p>
      <ul>
        <li>0 баллов выставляется в следующих случаях:</li>
        <ul>
          <li>участник анкетирования не взаимодействовал с анкетируемым СП;</li>
          <li>участник анкетирования является работником анкетируемого СП;</li>
          <li>участник анкетирования затрудняется оценить деятельность анкетируемого СП.</li>
        </ul>
      </ul>
      <p>
        В случае проставления 0 баллов автоматически проставляется комментарий «Не взаимодействую с
        СП», при необходимости комментарий можно изменить.
      </p>
      <ul>
        <li>
          1 - 5 – участник анкетирования выражает низкую степень удовлетворенности, результат
          деятельности СП не удовлетворяет ожиданиям
          <u>(требуется обязательное пояснение в виде комментария);</u>
        </li>
        <li>
          6 - 7 – участник анкетирования выражает среднюю степень удовлетворенности, результат
          деятельности СП не в полной мере удовлетворяет ожиданиям
          <u>(требуется обязательное пояснение в виде комментария); </u>
        </li>
        <li>
          8 - 10 – участник анкетирования выражает высокую степень удовлетворенности, результат
          деятельности СП превосходит ожидания
          <u>(комментарии не требуются или приводятся по желанию участника анкетирования).</u>
        </li>
      </ul>
      <p>При заполнении анкеты необходимо учитывать следующее:</p>
      <ul>
        <li>
          выставление объективной оценки деятельности анкетируемых СП за оцениваемый период времени;
        </li>
        <li>
          респондентам не допускается оценивать деятельность своего бизнес-процесса/СП. Оценки,
          выставленные респондентом по своему бизнес-процессу/СП, не будут учтены при подведении
          итогов анкетирования;
        </li>

        <li>
          оценка деятельности анкетируемых СП не должна зависеть от оценки предыдущего
          анкетирования;
        </li>

        <li>
          оценка деятельности анкетируемых СП должна проставляться с учетом разработанных
          корректирующих действий по предыдущему анкетированию и сроков их выполнения;
        </li>

        <li>
          комментарии должны быть краткими, емкими, отражать суть неудовлетворенности и относиться к
          деятельности анкетируемого СП за оцениваемый период времени;
        </li>

        <li>
          комментарии не должны повторяться (перед тем как приступить к написанию комментария,
          необходимо просмотреть мероприятия по результатам предыдущего анкетирования, вполне
          возможно, что вопрос уже обсуждался и был решен).
        </li>
      </ul>
    </div>
  </div>
</template>

<script lang="ts" setup>
import { useRoleStore } from '@/store'
import { ButtonComponent } from 'tnnc-ui-kit'
import { useRouter } from 'vue-router'

const router = useRouter()
const roleStore = useRoleStore()
function goToSurvey() {
  router.push({ path: '/survey' })
}
</script>
<style lang="scss">
.home {
  .main-description {
    max-width: 600px;
    margin-bottom: 20px;
    text-align: left;
  }
}
ul {
  padding-left: 20px;
}
li {
  font-size: 18px;
  font-weight: 300;
  margin-bottom: 5px;
}
u {
  text-decoration: underline;
  font-weight: 300;
}
.memorandum {
  margin-top: 30px;
}
</style>
